NAVIGATION = {
    'color': (1871, 221, 1872, 222),

    'position': (1890, 373, 1983, 408),
    'level': (1920, 413, 2000, 457),
    'main_entry_name': (1923, 530, 2220, 575),
    'main_entry_value': (2326, 530, 2456, 575),

    'sub_entry_data_3': (1923, 593, 2456, 734),
    'suit_name_3': (1869, 762, 2456, 806),
    'flag_3': (1869, 812, 1970, 849),

    'sub_entry_data_4': (1923, 593, 2456, 785),
    'suit_name_4': (1869, 813, 2456, 857),
    'flag_4': (1869, 866, 1970, 900)
}

COLOR = {
    'orange': (183, 141, 97),
    'purple': (139, 101, 197)
}

# 主词条
MAIN_ENTRY = {'攻击力', '攻击力百分比', '防御力百分比', '生命值', '生命值百分比',
              '暴击率', '暴击伤害', '击破特攻', '效果命中', '能量恢复效率', '治疗量加成', '速度',
              '火属性伤害提高', '物理属性伤害提高', '雷属性伤害提高', '风属性伤害提高', '冰属性伤害提高',
              '虚数属性伤害提高', '量子属性伤害提高'}
# 副词套
SUB_ENTRY = {'攻击力', '攻击力百分比', '防御力', '防御力百分比', '生命值', '生命值百分比',
             '暴击率', '暴击伤害', '击破特攻', '效果命中', '效果抵抗', '速度'}
# 总词条
ENTRY = MAIN_ENTRY | SUB_ENTRY | {'速度百分比'}
# 百分数词条
PER_ENTRY = {'攻击力百分比', '防御力百分比', '生命值百分比', '速度百分比', '暴击率', '暴击伤害', '击破特攻', '效果命中',
             '效果抵抗'}
# 数值词条
NON_PER_ENTRY = ENTRY - PER_ENTRY
# 面板词条（即舍去xx伤害提高）
PANEL_ENTRY = {key for key in ENTRY if ('属性伤害提高' not in key)}
# 乘区词条（爆伤乘区记在面板词条中，因此九大乘区，八个乘区词条）
MULTIPLIER_ENTRY = {'倍率', '增伤', '虚弱', '防御', '抗性', '易伤', '减伤', '击破状态'}

# 套装
OUTER_SUIT = {'毁烬焚骨的大公', '幽锁深牢的系囚', '宝命长存的莳者', '骇域漫游的信使', '密林卧雪的猎人',
              '晨昏交界的翔鹰',
              '流星追迹的怪盗', '街头出身的拳王', '云无留迹的过客', '野穗伴行的快枪手', '戍卫风雪的铁卫',
              '繁星璀璨的天才',
              '净庭教宗的圣骑士', '激奏雷电的乐队', '熔岩锻铸的火匠', '盗匪荒漠的废土客', '机心戏梦的钟表匠',
              '死水深潜的先驱'}
INNER_SUIT = {'梦想之地匹诺康尼', '苍穹战线格拉默', '折断的龙骨', '繁星竞技场', '太空封印站', '不老者的仙舟',
              '生命的翁瓦克',
              '星体差分机', '盗贼公国塔利亚', '泛银河商业公司', '筑城者的贝洛伯格', '停转的萨尔索图',
              '无主荒星茨冈尼亚',
              '出云显世与高天神国'}
SUIT = OUTER_SUIT | INNER_SUIT

POSITION_INDEX = {'头部': 0, '手部': 1, '躯干': 2, '脚部': 3, '位面球': 4, '连结绳': 5}
POSITION_LIB = ['头部', '手部', '躯干', '脚部', '位面球', '连结绳']

MULTIPLIER_LIB = ['基础', '暴伤', '增伤', '虚弱', '防御', '抗性', '易伤', '减伤', '击破状态']

# 等级
ATTACKER_LEVEL = 80
ENEMY_LEVEL = 95
